<?php
// +----------------------------------------------------------------------
// | 联盟管理平台
// +----------------------------------------------------------------------
// | Copyright (c) 2017~2020 http://www.qyhzlm.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 商业版权，禁止传播，违者必究  )
// +----------------------------------------------------------------------
// | Author: oliver <2244115959@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 摄像头模型
// +----------------------------------------------------------------------

namespace app\zhibo\model;

use app\manage\model\CommonMod;

class ZhiboCamera extends CommonMod{
       public function getIsusetextAttr($value,$data){
           $types = config('data.camera.isuse');
           return $types[$data['isuse']];
       }
}