<?php
// +----------------------------------------------------------------------
// | 联盟管理平台
// +----------------------------------------------------------------------
// | Copyright (c) 2017~2020 http://www.qyhzlm.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 商业版权，禁止传播，违者必究  )
// +----------------------------------------------------------------------
// | Author: oliver <2244115959@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 管理首页
// +----------------------------------------------------------------------
namespace app\manage\controller;

class Member extends ManageController{
	
	public function _initialize(){
		parent::_initialize();
	}

	/**
	 * 首页面
	 */
	public function index() {
		$menu = $this->getMenu();
		$this->assign('menu',$menu);
		return $this->fetch();
	}
	
}