<?php
// +----------------------------------------------------------------------
// | 联盟管理平台
// +----------------------------------------------------------------------
// | Copyright (c) 2017~2020 http://www.qyhzlm.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 商业版权，禁止传播，违者必究 )
// +----------------------------------------------------------------------
// | Author: oliver <2244115959@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 公众号模板模型
// +----------------------------------------------------------------------
namespace app\wechat\model;

use app\manage\model\CommonMod;

class WechatTemplate extends CommonMod
{
    protected $pk = 'short_id';
    
    protected function getFormAttr($value){
    	if(!empty($value)){
    		return json_decode($value,true);
    	}
    	return [];
    }
}