<?php
// +----------------------------------------------------------------------
// | 联盟管理平台
// +----------------------------------------------------------------------
// | Copyright (c) 2017~2020 http://www.qyhzlm.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 商业版权，禁止传播，违者必究  )
// +----------------------------------------------------------------------
// | Author: oliver <2244115959@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 教师表单验证器
// +----------------------------------------------------------------------

namespace app\guanke\validate;

use think\Validate;

class TeacherValid extends Validate{
    
    protected $rule = [
        'name'=>  ['require'],
        'capital'  =>  ['require'],
    ];
    
    protected $message = [
        'name.require'       => '教师名称不能为空',
        'capital.require'     => '头衔不能为空',
    ];
    
    protected $scene = [
        'edit'   =>  ['name','capital'],
    ];
}